<!DOCTYPE html>
<html>
<head>
	<title>Функції</title>
	<meta name="viewport" content="width=device-width, initial-scale=1.0">
	<meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" type="text/css" href="../style/reset.css">
    <link rel="stylesheet" type="text/css" href="../style/style.css">
    <link rel="stylesheet" type="text/css" href="../style/vs2015.css">
    <script type="text/javascript" src="../js/jquery-3.3.1.min.js"></script>
    <script type="text/javascript" src="../js/jquery.shuffleLetters.js"></script>
    <script type="text/javascript" src="../js/script.js" defer></script>
    <script type="text/javascript" src="../js/highlight.pack.js"></script>
    <link href="../img/ICON.ico" rel="shortcut icon" type="image/x-icon">
    <meta charset="utf-8">
</head>
<body>
<?php require "top.php";?>
<main>
	<div class="manual_wrapper">
		<?php require "sidebar.php";?>
        <div class="content_of_manual">
		<center><h1>Функції у C++</h1></center>
        <br>
        <h2>Об’явлення та визначення функцій</h2>
        <p>Функція – це іменована послідовність операторів, що виконує якунебудь закінчену дію. Функція може одержувати параметри і повертати єдине значення. Будь-яка функція в програмі повинна бути об’явлена і визначена. Об’явлення функції повинне бути зроблено до її виклику, щоб компілятор міг правильно обробити її параметри.</p>
        <p>Визначення функції (прототип функції) задає її ім'я, тип значення, що повертається, і список одержуваних параметрів. Після визначення слідує тіло функції – складений оператор, що містить оператори, які визначають дію функції.</p>
        <p>Формат визначення функції: </p>
<pre><code class="cpp"> тип ім'я_функції (список_параметрів)

        {
                тіло функції

                return значення
        }   </code></pre>
        <p>Тип значення, що повертається функцією може бути будь-яким, крім масиву і функції (але може бути вказівником на масив або функцію). Якщо функція не повинна повертати значення, то вона повинна мати тип void.</p>
        <p>Список_параметрів визначає величини, що потрібно передати у функцію при її виклику. Елементи списку параметрів розділяються комами. Для кожного параметра вказується його тип і ім'я.</p>
        <p>У визначенні, в оголошенні і при виклику однієї і тієї ж функції типи і порядок слідування параметрів повинні збігатися.
        Для виклику функції потрібно вказати її ім'я, а за ним у круглих дужках – імена переданих аргументів (через кому). Виклик функції може розташовуватися в будь-якому місці програми. Виключення – функція типу void не може входити до складу виражень або розташовуватися в правій частині оператора присвоювання.</p>
        <p>Усі величини, описані у функції, а також її параметри являються локальними. Їхня область дії обмежена межами цієї функції. При виході з функції значення локальних змінних губляться. Якщо цього потрібно уникнути, при описі локальних змінних використовується модифікатор static.</p>
        <h2>Обмін даними між функціями</h2>
        <p>Обмін даними між функціями може виконуватися наступними шляхами:</p>
        <p>1) за допомогою глобальних змінних;</p>
        <p>2) через значення, що повертається.</p>
        <p>3) через параметри;</p>
        <h2>Глобальні змінні</h2>
        <p>Глобальні змінні доступні усередині будь-якої функції, де немає однойменних локальних змінних. Але їх використовувати не рекомендується, тому що це утрудняє налагодження і робить функцію залежною від іншої програми (неможливість виділити функцію в окрему бібліотеку).</p>
        <p>Значення, що повертається. Повернення з функції в точку її виклику здійснюється оператором:</p>
<pre><code class="cpp"> return вираження;    </code></pre>
        <p>У функції може бути декілька операторів return. Якщо функція описана як void, вираження не вказується (може навіть бути відсутнім і оператор return).</p>
        <p>Вираження, зазначене в операторі return неявно перетвориться до типу значення, що повертається функцією, і передається в точку виклику. Забороняється повертати з функції вказівник на локальну змінну, тому що пам'ять, виділена циєї змінної при виході з функції звільняється.</p>
        <h2>Параметри функції</h2>
        <p>Параметри, зазначені в заголовку при описі функції являються формальними. Параметри, задані при виклику функції, називаються фактичними (аргументами).</p>
        <p>Способи передачі параметрів у функцію:</p>
        <p>1) за значенням;</p>
        <p>2) за адресою (по посиланню).</p>
        <p>При передачі за значенням функція одержує копії значень параметрів.</p>
        <p>Можливість змінити самі параметри відсутня. При передачі за адресою функція одержує адреси аргументів. При цьому функція може змінити значення аргументів. Якщо потрібно заборонити зміну параметра усередині функції, використовується модифікатор const.</p>
        <p>Код програми 1: Функція для обміну двох цілих чисел.</p>
<pre><code class="cpp"> #include "iostream.h"

        void swap(int &x, int &y)

        {

        int z;

        z=x;

        x=y;

        y=z;

        }

        void main()

        {

        int a=20,b=40;

        cout<<"Значення до обміну"<< endl;

        cout<<"a="<< a<< endl;

        cout<<"b="<< b<< endl;

        swap(a,b);

        cout<<"Значення після обміну"<< endl;

        cout<<"b="<< b<< endl;

        cout<<"a="<< a<< endl;

        }   </code></pre>
        <p>Примітка – Аргумент може передаватися або як вказівник, або як посилання. При передачі по посиланню усередині функції при звертанні до параметра неявно виконується операція розіменування. При використанні вказівника програміст повинний явно задавати операцію розіменування.</p>
        <h2>Рекурсія</h2>
        <p>Рекурсія – це здатність функції викликати саму себе.</p>
        <p>Пряма рекурсія – коли функція викликає сама себе безпосередньо.</p>
        <p>Непряма рекурсія – коли функція викликає себе через іншу функцію.<br>Для нормального завершення будь-яка рекурсивна функція повинна містити хоча б одну нерекурсивну галузь, що закінчується оператором повернення.</p>
<script type="text/javascript">hljs.initHighlightingOnLoad();</script>
        <div class="comments">
<div class="fb-comments"  data-width="100%" data-numposts="5"></div>
<script>
var url = location.href;
var comm = document.getElementsByClassName('fb-comments')[0];
comm.setAttribute('data-href',url);
</script>
</div>
        </div>
    </div>
</main>
<?php require "bottom.php";?>
</body>
</html>